[
  {
    "name": "Le Wagon",
    "description": "Le Wagon is a global tech training provider that offers full-time, in-person and online bootcamps in Web Development, Data Science, and Data Analytics. Le Wagon also offers part-time courses in Web Analytics, Python  Machine Learning, Growth  Data Automation, and Data Analytics Essentials. Le Wagon is aimed at individuals seeking to change careers or acquire specific skills. Le Wagon’s training has helped more than 18,000 students accelerate their careers, transition into tech, or launch startups. Le Wagon was founded in 2013 in Paris, and now has in-person campuses in over 40 cities and 25 countries. \n Read More",
    "tracks": ["Full Stack Developer", "Front End Developer", "Data Science"],
    "page_link": "https://www.coursereport.com/schools/le-wagon",
    "courses": [{ "course_name": "Le Wagon Courses" }]
  },
  {
    "name": "Nucamp",
    "description": "Nucamp is a coding bootcamp that offers part-time, online programs, including Back End, SQL, DevOps with Python (16 weeks); Front End Web  Mobile Development (17 weeks); and Full Stack Web  Mobile Development (22 weeks). Nucamp also offers a 4-week introduction bootcamp that covers the fundamentals of HTML, CSS, and JavaScript. Nucamp is on a mission to make quality education accessible and affordable to everyone. The online bootcamps include both self-paced and actively mentored study, and there are no more than 15 students per class with a dedicated instructor for each cohort. \n Read More",
    "tracks": [
      "Full Stack Developer",
      "Mobile App Development",
      "Front End Developer"
    ],
    "page_link": "https://www.coursereport.com/schools/nucamp",
    "courses": [{ "course_name": "Nucamp Courses" }]
  },
  {
    "name": "BrainStation",
    "description": "BrainStation offers full-time and part-time courses in data science, design, development, marketing, cyber security and product in New York City, Miami, London, Toronto, Vancouver, and through an Online Live platform. BrainStation’s goal is to empower individuals, businesses, and brands to succeed in the digital age by offering diploma programs, certification courses, and training options across the full digital product lifecycle. BrainStation provides a collaborative, project-based learning experience, with curriculum updated on a daily basis to ensure professionals gain the skills and experience needed to succeed in their careers.\n Read More",
    "tracks": ["Full Stack Developer", "Mobile App Development", "UX Design"],
    "page_link": "https://www.coursereport.com/schools/brainstation",
    "courses": [{ "course_name": "BrainStation Courses" }]
  },
  {
    "name": "Springboard",
    "description": "Springboard is an online learning platform that prepares students for the tech industry’s most in-demand careers with comprehensive, mentor-led online programs in software engineering, data science, UI/UX design, cybersecurity, tech sales, and more. All Springboard courses are 100% online, remote, and self-paced throughout an average of 6-9 months. Springboard acts as a support system, coach, and cheerleader for working professionals who are ready to level-up or make a major career shift. Students have access to a unique community of industry mentors, thought leaders, and alumni, who are on hand to offer insights, networking opportunities, and support throughout the program and well past graduation. Every Springboard student is matched with a personal student advisor and industry mentor who guides them throughout the program through regular video calls.\n Read More",
    "tracks": ["Full Stack Developer", "Tech Sales", "Data Science"],
    "page_link": "https://www.coursereport.com/schools/springboard",
    "courses": [{ "course_name": "Springboard Courses" }]
  },
  {
    "name": "CareerFoundry",
    "description": "CareerFoundry is an online bootcamp that offers flexibly paced programs for career changers in web development, UX design, UI design, data analytics, digital marketing, and product management. Headquartered in Berlin but with a global student base, CareerFoundry has provided tech education since 2013.\n Read More",
    "tracks": ["Full Stack Developer", "Product Manager", "Digital Marketing"],
    "page_link": "https://www.coursereport.com/schools/careerfoundry",
    "courses": [{ "course_name": "CareerFoundry Courses" }]
  },
  {
    "name": "App Academy",
    "description": "Founded in 2012, App Academy is a global coding bootcamp with a focus on software engineering. App Academy offers programs that fit every learning style, including an In-Person Software Engineering Program (16 weeks), a Full-Time Online Software Engineering Program (24 weeks), and a Part-Time Online Software Engineering Program (52 weeks). App Academy alumni have found Software Engineering roles at a range of start-ups and top tech companies.\n Read More",
    "tracks": ["Full Stack Developer", "UX Design", "Front End Developer"],
    "page_link": "https://www.coursereport.com/schools/app-academy",
    "courses": [{ "course_name": "App Academy Courses" }]
  },
  {
    "name": "Ironhack",
    "description": "Ironhack offers full-time and part-time bootcamps in Web Development, UX/UI design, Data Analytics and Cyber Security in Miami (Florida), Madrid and Barcelona (Spain), Paris (France) Mexico City (Mexico), Berlin (Germany), Amsterdam (Netherlands), Sao Paulo (Brazil), Lisbon (Portugal) and remotely. Ironhack uses a customized approach to education by allowing students to shape their experience based on personal goals. Students who graduate from the Web Development Bootcamp will be skilled in technologies like JavaScript, HTML5 and CSS3. The UX/UI program covers Design Thinking, Photoshop, Sketch, Balsamiq, InVision, and JavaScript. Data Analytics covers data wrangling/cleaning, APIs, web scraping, and intermediate topics in Git, MySQL, Python, Data visualization, Panda, and Machine Learning. The Data Analytics program allows students to load, clean, explore and extract valuable insights from datasets and cultivate languages, such as Python, SQL and Tableau. The Cyber Security course provides students with the hands-on skills they need to land a job in the growing cybersecurity industry. In the Cyber Security course, students will develop the most in-demand knowledge to be part of any company's cybersecurity workforce and become a cybersecurity professional.\n Read More",
    "tracks": ["Full Stack Developer", "Data Science", "Front End Developer"],
    "page_link": "https://www.coursereport.com/schools/ironhack",
    "courses": [{ "course_name": "Ironhack Courses" }]
  },
  {
    "name": "Thinkful",
    "description": "Thinkful, a Chegg service, provides every adult learner with a pathway to a rewarding career. This online bootcamp offers fast-paced, career-focused programs in Software Engineering, Data Science, Data Analytics, UX/UI Design, Digital Marketing, and Technical Project Management. These programs are offered in part-time and full-time formats. Students commit 20-25 hours per week in the part-time format, and up to 60 hours in the full-time option. All programs include personal mentor meetings, a custom-built curriculum, and Q sessions with industry professionals. \n Read More",
    "tracks": ["Full Stack Developer", "Data Science", "Front End Developer"],
    "page_link": "https://www.coursereport.com/schools/thinkful",
    "courses": [{ "course_name": "Thinkful Courses" }]
  },
  {
    "name": "Simplilearn",
    "description": "Simplilearn’s Masters Programs are intensive, online bootcamps for Full Stack Web Development, Data Science and Analytics, AI and Machine Learning, Big Data Cloud Computing, Cyber Security, Project Management, Digital Marketing, among others. Simplilearn’s efforts are focused on helping people acquire the skills they need to thrive in the digital economy. Each bootcamp comprises of live online classes from world-class industry practitioners and highly-rated trainers, integrated online labs, projects, case studies, industry masterclasses and 24/7 support to offer learners the best chance at succeeding in the professional world. This practical and outcomes-focused approach has resulted in 85 percent of learners reporting career benefits including promotion or a new job.\n Read More",
    "tracks": ["Full Stack Developer", "UX Design", "Product Manager"],
    "page_link": "https://www.coursereport.com/schools/simplilearn",
    "courses": [{ "course_name": "Simplilearn Courses" }]
  },
  {
    "name": "General Assembly",
    "description": "General Assembly is a technical education provider that teaches students the skills, career advice and networking opportunities needed to make a career change into a tech role, in as little as three months. General Assembly offers bootcamps and courses in web and mobile development, product management, data science and more. \n Read More",
    "tracks": ["Full Stack Developer", "Data Science", "Product Manager"],
    "page_link": "https://www.coursereport.com/schools/general-assembly",
    "courses": [{ "course_name": "General Assembly Courses" }]
  },
  {
    "name": "Udacity",
    "description": "Udacity offers Nanodegrees which are online immersive full-time and part-time programs, ranging from 12-24 weeks in length for students worldwide. Nanodegree courses are available in subjects like data science, artificial intelligence, programming, autonomous systems, business, and cloud computing. Udacity's approach to talent transformation incorporates projects based on real-world scenarios, guided by personalized mentor support with a focus on in-demand digital competencies in areas like AI, cloud computing, cybersecurity, programming, data science, and more. The custom learning program enables students to learn at their own pace, and manage monthly payments for their programs to fit their budgets. \n Read More",
    "tracks": ["Full Stack Developer", "Cyber Security", "Data Science"],
    "page_link": "https://www.coursereport.com/schools/udacity",
    "courses": [{ "course_name": "Udacity Courses" }]
  },
  {
    "name": "Coding Dojo",
    "description": "Founded in 2012, Coding Dojo is a global technology education company that offers programs in Software Development, Data Science, and Cybersecurity. Students can choose to learn coding languages in Python, JavaScript, Java and C#/.NET Core, dig deeper into data and visualization in Python, and be mission-ready to defend in Cybersecurity. In addition to an extensive curriculum, students collaborate with peers, join interactive lectures with instructors, have unlimited support from career services, and access to Teaching Assistants seven days a week. \n Read More",
    "tracks": ["Full Stack Developer", "Cyber Security", "Front End Developer"],
    "page_link": "https://www.coursereport.com/schools/coding-dojo",
    "courses": [{ "course_name": "Coding Dojo Courses" }]
  },
  {
    "name": "Edureka",
    "description": "Edureka offers instructor-led, live online bootcamps in Full Stack Web Development (8 weeks) and AI  Machine Learning (44 weeks). The Full Stack Web Development bootcamp is completed in 8 weeks, and requires a time commitment of 20-30 hours per week. The AI  Machine Learning bootcamp is completed in 44 weeks, and requires a time commitment of 8-10 hours per week. \n Read More",
    "tracks": ["Full Stack Developer", "Data Science"],
    "page_link": "https://www.coursereport.com/schools/edureka",
    "courses": [{ "course_name": "Edureka Courses" }]
  },
  {
    "name": "Flatiron School",
    "description": "Flatiron School offers immersive on-campus and online programs in software engineering, data science, cybersecurity, and product design (UX/UI design). Flatiron School’s immersive courses aim to launch students into fulfilling careers by providing a robust career services framework and dedicated one-on-one coaching post graduation that is included as an added value with the tuition. \n Read More",
    "tracks": ["Full Stack Developer", "Data Science", "Cyber Security"],
    "page_link": "https://www.coursereport.com/schools/flatiron-school",
    "courses": [{ "course_name": "Flatiron School Courses" }]
  },
  {
    "name": "Codesmith",
    "description": "Codesmith is a coding school redefining the way software engineering is taught. Codesmith offers full-time (13-week) and part-time (38-week) remote software engineering immersive programs as well as a full-time NYC Onsite program. Codesmith focuses on concepts and technologies such as full-stack JavaScript, computer science, machine learning, Dev Ops, React, and more. The immersives are advanced residencies designed to help individuals launch meaningful, high-level careers in software engineering. \n Read More",
    "tracks": ["Full Stack Developer", "Front End Developer"],
    "page_link": "https://www.coursereport.com/schools/codesmith",
    "courses": [{ "course_name": "Codesmith Courses" }]
  },
  {
    "name": "Actualize",
    "description": "Actualize is a 12-week software development bootcamp in Chicago and online throughout the US, offering both part-time and full-time options. Instructors with professional educational experience teach students full stack web development including Ruby, Rails, JavaScript, VueJS, SQL, and Git. Both the in-person and online programs use the same immersive, instruction-driven curriculum, with the Online Live classes conducted in real time with video conferencing. Actualize has a deeply integrated “Job Hacking” curriculum focused on the personal branding and networking skills necessary to land a new job, which Actualize feels is just as important as learning to code.\n Read More",
    "tracks": ["Full Stack Developer"],
    "page_link": "https://www.coursereport.com/schools/actualize",
    "courses": [{ "course_name": "Actualize Courses" }]
  },
  {
    "name": "Tech Elevator",
    "description": "Tech Elevator offers both full-time and part-time coding bootcamps that prepare students for a career as a software developer, starting with an Aptitude Test. Applicants can then choose to study Java or .NET. Throughout the bootcamp, students also learn HTML, CSS, SQL, API, and JavaScript. The full-time bootcamp runs for 14 weeks, Monday through Friday, 9-4:30 pm, and the part-time bootcamp runs for 30-weeks with a mix of independent study, live lectures and small-group programming. Both programs have a low student-to-instructor ratio to ensure the best supportive environment for participants. Tech Elevator’s instruction is delivered both remotely and in-person at campuses located in Cincinnati, Cleveland, Columbus, Charlotte, Chicago, Dallas, Detroit, Philadelphia, Pittsburgh and Wilmington. Tech Elevator also offers students beyond its core markets, and throughout North America, class options through its National Live Remote program.\n\n Read More",
    "tracks": ["Full Stack Developer"],
    "page_link": "https://www.coursereport.com/schools/tech-elevator",
    "courses": [{ "course_name": "Tech Elevator Courses" }]
  },
  {
    "name": "Skillcrush",
    "description": "Skillcrush is a woman-owned, independent, online coding  design school founded in 2012. Skillcrush offers both free and paid programs, including the self-paced Break Into Tech + Job Guarantee program, which prepares students for entry-level positions in front end development and design. Skillcrush is on a mission to empower career changers — with a special focus on women and BIPOC — with the technical skills they need to transition into higher-earning, more fulfilling and flexible careers in tech.\n Read More",
    "tracks": ["Full Stack Developer", "Front End Developer", "UX Design"],
    "page_link": "https://www.coursereport.com/schools/skillcrush",
    "courses": [{ "course_name": "Skillcrush Courses" }]
  },
  {
    "name": "Makers Academy",
    "description": "Makers Academy is a highly selective, 16-week, full-time program which teaches web development online and in hybrid cohorts at their campus in London, England. Makers Academy is creating a new generation of tech talent who are skilled and ready for the changing world of work. The academy is inspired by the idea of discovering and unlocking potential in people for the benefit of the 21st-century business and society. At the core, Makers combines tech education with employment possibilities that transform lives. The academy accepts only exceptional applicants into the course. While they are highly selective, they focus on a student's passion for becoming a developer by gauging their coding experience. Makers Academy also offers apprenticeships in Software Engineering and DevOps.\n Read More",
    "tracks": ["Full Stack Developer"],
    "page_link": "https://www.coursereport.com/schools/makers-academy",
    "courses": [{ "course_name": "Makers Academy Courses" }]
  },
  {
    "name": "The Tech Academy",
    "description": "The Tech Academy is a trade school headquartered in Portland, Oregon that offers full-time and part-time bootcamps online and in-person at their Portland campus.The Tech Academy offers bootcamps in computer programming, website development, cybersecurity, game development, mobile development, data science, and front-end development. The immersive experience aims to create well-rounded technology professionals, and also gives students the option to take the course at their own pace. There are also no set starts dates or rigid scheduling. Students can enroll at any time, study from home, and choose whatever study schedule they would like. \n Read More",
    "tracks": [
      "Full Stack Developer",
      "Mobile App Development",
      "Data Science"
    ],
    "page_link": "https://www.coursereport.com/schools/the-tech-academy",
    "courses": [{ "course_name": "The Tech Academy Courses" }]
  },
  {
    "name": "Fullstack Academy",
    "description": "Fullstack Academy is a tech bootcamp that offers immersive online programs for web development, cybersecurity, data analytics, DevOps, and product management. Fullstack Academy was founded in 2012 and also offers the Grace Hopper Program, an immersive software engineering course for women and non-binary students, in addition to partnerships with leading universities nationwide.\n Read More",
    "tracks": [
      "Full Stack Developer",
      "Product Manager",
      "Front End Developer"
    ],
    "page_link": "https://www.coursereport.com/schools/fullstack-academy",
    "courses": [{ "course_name": "Fullstack Academy Courses" }]
  },
  {
    "name": "Clarusway",
    "description": "Virginia-based IT training school, Clarusway offers online bootcamps in three main program tracks: AWS DevOPs, Full Stack Development, and Data Science. Bootcamps can be completed in 24-36 weeks depending on the student’s incoming skill level. Clarusway is committed to helping individuals attain practical knowledge through affordable and effective IT training programs. Clarusway programs include mentorship programs, peer-learning, and project-based group study methods. Students gain requisite classroom knowledge paired with the necessary hands-on skills demanded by today’s tech industry.  \n Read More",
    "tracks": ["Full Stack Developer", "Cyber Security", "Data Science"],
    "page_link": "https://www.coursereport.com/schools/clarusway",
    "courses": [{ "course_name": "Clarusway Courses" }]
  },
  {
    "name": "Devmountain",
    "description": "Devmountain is a coding bootcamp that offers short, full-time in-person programs designed to prepare students for entry-level positions in the tech industry. There are Devmountain campuses in Lehi, Utah; Dallas, Houston, San Antonio, Fort Worth, Killeen, Texas; and Cobb County and Lithonia, Georgia. Devmountain also offers online courses.\n Read More",
    "tracks": ["Full Stack Developer", "Mobile App Development", "UX Design"],
    "page_link": "https://www.coursereport.com/schools/devmountain",
    "courses": [{ "course_name": "Devmountain Courses" }]
  },
  {
    "name": "DigitalCrafts",
    "description": "DigitalCrafts offers full-time and part-time online bootcamps in Web Development, Cybersecurity, and UX Design. All classes are taught online by live instructors, and WeWork memberships are included at no additional charge for students needing a place to study.\n Read More",
    "tracks": ["Full Stack Developer", "Front End Developer", "Cyber Security"],
    "page_link": "https://www.coursereport.com/schools/digitalcrafts",
    "courses": [{ "course_name": "DigitalCrafts Courses" }]
  },
  {
    "name": "Hack Reactor",
    "description": "Hack Reactor by Galvanize is an educator for rapid career transformation, offering software engineering bootcamps designed so that anyone with motivation can succeed, regardless of education, experience, or background. Hack Reactor by Galvanize bootcamps are challenging and designed to fit a student’s schedule and skill level. Bootcamps include a 19-Week Software Engineering Immersive with JavaScript and Python, designed for beginners, as well as a 12-Week Software Engineering Immersive. \n Read More",
    "tracks": ["Full Stack Developer"],
    "page_link": "https://www.coursereport.com/schools/hack-reactor",
    "courses": [{ "course_name": "Hack Reactor Courses" }]
  }
]
